dj803/esp32_node_firmware/esp32_node_firmware/include/ota.h
#pragma once

#include <Arduino.h>
#include <ESP32OTAPull.h>
#include <HTTPClient.h>
#include <ArduinoJson.h>
#include <esp_https_ota.h>     // (v0.3.35) Phase 3 — replace ESP32-OTA-Pull's writer
#include <esp_http_client.h>
#include <esp_crt_bundle.h>    // built-in CA bundle for esp-tls
#include "esp_task_wdt.h"  // esp_task_wdt_delete — unsubscribe async_tcp before download
#include "config.h"
#include "logging.h"
#include "fwevent.h"
#include "semver.h"   // semverIsNewer() — extracted to allow host-side unit testing
#include "app_config.h"   // gAppConfig.ota_json_url set via portal
#include "led.h"

// (v0.3.34) Forward-declared from ota_validation.h. Cannot #include directly
// because the validation module needs to be ordered after mqtt_client.h
// (uses mqttPublishStatus) but before ota.h (provides otaValidationArmRollback
// for the ESP.restart path below). Decoupling via forward decl avoids the
// circular include.
void otaValidationArmRollback(const char* targetVersion);
#ifdef BLE_ENABLED
#include <NimBLEDevice.h>   // NimBLEDevice::deinit() — free BLE heap before OTA flash write
#endif

// =============================================================================
// ota.h  —  Automatic OTA firmware updates via ESP32-OTA-Pull (spec §13)
//
// HOW IT WORKS:
//   1. Every OTA_CHECK_INTERVAL_MS (default 1 hour), or immediately when
//      triggered by an MQTT message on .../cmd/ota_check, the device calls
//      otaCheckNow().
//
//   2. otaCheckNow() fetches the JSON filter file at gAppConfig.ota_json_url
//      (a stable GitHub Pages URL) using the ESP32-OTA-Pull library.
//      The JSON contains the latest firmware version and its download URL:
//
//        {
//          "Configurations": [
//            {
//              "Version": "1.3.0",
//              "URL": "https://github.com/<owner>/<repo>/releases/download/v1.3.0/firmware.bin"
//            }
//          ]
//        }
//
//   3. If the JSON version is strictly newer than FIRMWARE_VERSION, the library
//      downloads firmware.bin and writes it directly to the inactive OTA flash
//      partition. The ESP32's bootloader then boots from the new partition.
//
//   4. NVS (credentials, device UUID, broker cache) is on a separate partition
//      and survives the OTA update unchanged.
//
// SECURITY NOTE:
//   ESP32-OTA-Pull uses HTTPClient without explicit CA certificate pinning.
//   HTTPS traffic is encrypted in transit but the server certificate is not
//   verified against a pinned root CA. For an internal IoT deployment this is
//   acceptable. See config.h for more detail.
//
// NOTE: mqttPublishStatus() is defined in mqtt_client.h, which is #included
// BEFORE this file in the main sketch, so no forward declaration is needed here.
// =============================================================================


// ── Module state ──────────────────────────────────────────────────────────────
static uint32_t     _lastOtaCheck         = 0;     // millis() timestamp of last check
static bool         _otaForced            = false; // True when MQTT has requested an immediate check
static TimerHandle_t _otaProgressWatchdog = NULL;  // One-shot stall detector during download

// One-shot FreeRTOS timer fired if no progress callback arrives within
// OTA_PROGRESS_TIMEOUT_MS. Recovers from CDN stalls / TCP black-holes that
// don't trip the TWDT (e.g. v0.3.28 Charlie freeze).
static void _otaProgressTimeout(TimerHandle_t /*xTimer*/) {
    LOG_E("OTA", "Progress watchdog fired (no callback for %d ms) - restarting",
          OTA_PROGRESS_TIMEOUT_MS);
    ESP.restart();
}



// ── otaExtractBinaryUrl ───────────────────────────────────────────────────────
// (v0.3.35 / Phase 3) Re-fetches the manifest at `manifestUrl` and pulls
// out the .bin URL of the first profile that matches our board (or has no
// Board filter set). Mirrors ESP32-OTA-Pull's selection logic so existing
// manifests work unchanged.
//
// Why a second fetch? ESP32-OTA-Pull does NOT expose the URL it found
// during Pass 1 — it only stores Version. For Pass 2 we now use
// esp_https_ota (resume-capable, actively maintained) which needs the
// .bin URL directly. The duplicate fetch is ~200 bytes of JSON over the
// already-warm TLS connection — cheap.
//
// Returns: empty String on failure; .bin URL on success. Caller must
// validate that the returned String is non-empty before passing it to
// esp_https_ota_begin().
static String otaExtractBinaryUrl(const char* manifestUrl) {
    HTTPClient http;
    http.setTimeout(10000);
    if (!http.begin(manifestUrl)) {
        LOG_W("OTA", "otaExtractBinaryUrl: http.begin failed");
        return String();
    }
    int code = http.GET();
    if (code != HTTP_CODE_OK) {
        LOG_W("OTA", "otaExtractBinaryUrl: GET %s -> %d", manifestUrl, code);
        http.end();
        return String();
    }
    String payload = http.getString();
    http.end();

    JsonDocument doc;
    DeserializationError err = deserializeJson(doc, payload);
    if (err) {
        LOG_W("OTA", "otaExtractBinaryUrl: JSON parse error %s", err.c_str());
        return String();
    }

    JsonArray configs = doc["Configurations"].as<JsonArray>();
    for (JsonObject cfg : configs) {
        const char* board = cfg["Board"]   | "";
        const char* url   = cfg["URL"]     | "";
        // Match if Board is empty/missing or equals our board.
        if (strlen(board) > 0 && strcmp(board, ARDUINO_BOARD) != 0) continue;
        if (strlen(url) == 0) continue;
        return String(url);
    }
    return String();
}


// ── otaPerformWithEspIdf ──────────────────────────────────────────────────────
// (v0.3.35 / Phase 3) The replacement for ESP32-OTA-Pull's Pass 2.
// Uses Espressif's esp_https_ota with partial_http_download=true so a stalled
// download can resume (where the server supports HTTP Range requests).
// Returns 0 on success, negative on any failure.
//
// Caller is responsible for:
//   - MQTT teardown + async_tcp WDT unsubscribe (handled in otaCheckNow)
//   - BLE deinit (handled in otaCheckNow)
//   - Pre-flight heap gate (handled in otaCheckNow)
//   - LoopTask TWDT subscribe (handled in otaCheckNow)
//   - Progress watchdog arm (handled in otaCheckNow)
//
// This function only owns the perform-loop and progress logging.
static int otaPerformWithEspIdf(const char* binaryUrl) {
    LOG_I("OTA", "esp_https_ota: starting download from %s", binaryUrl);

    esp_http_client_config_t http_cfg = {};
    http_cfg.url                  = binaryUrl;
    http_cfg.crt_bundle_attach    = esp_crt_bundle_attach;   // use framework's CA bundle
    http_cfg.timeout_ms           = 30000;
    http_cfg.keep_alive_enable    = true;

    esp_https_ota_config_t ota_cfg = {};
    ota_cfg.http_config           = &http_cfg;
    ota_cfg.partial_http_download = true;   // enable HTTP Range support
    ota_cfg.max_http_request_size = 16 * 1024;  // chunk size cap

    esp_https_ota_handle_t handle = nullptr;
    esp_err_t err = esp_https_ota_begin(&ota_cfg, &handle);
    if (err != ESP_OK) {
        LOG_E("OTA", "esp_https_ota_begin failed: %d (%s)", err, esp_err_to_name(err));
        return -1;
    }

    int totalSize = esp_https_ota_get_image_size(handle);
    LOG_I("OTA", "esp_https_ota: image size = %d bytes", totalSize);

    int lastPct = -1;
    while (true) {
        // Reset watchdogs on every iteration. esp_https_ota_perform processes
        // one HTTP chunk per call so this is the analogue of ESP32-OTA-Pull's
        // SetCallback chunk-by-chunk hook.
        esp_task_wdt_reset();
        if (_otaProgressWatchdog) xTimerReset(_otaProgressWatchdog, 0);

        err = esp_https_ota_perform(handle);
        if (err != ESP_ERR_HTTPS_OTA_IN_PROGRESS) break;

