dj803/esp32_node_firmware/esp32_node_firmware/include/ota.h
        int writtenBytes = esp_https_ota_get_image_len_read(handle);
        int pct = (totalSize > 0) ? (writtenBytes * 100 / totalSize) : 0;
        if (pct / 10 != lastPct / 10) {
            LOG_I("OTA", "Progress: %d%%", pct);
            lastPct = pct;
        }
    }

    if (err != ESP_OK) {
        LOG_E("OTA", "esp_https_ota_perform failed: %d (%s)", err, esp_err_to_name(err));
        esp_https_ota_abort(handle);
        return -2;
    }

    if (!esp_https_ota_is_complete_data_received(handle)) {
        LOG_E("OTA", "esp_https_ota: incomplete image received");
        esp_https_ota_abort(handle);
        return -3;
    }

    err = esp_https_ota_finish(handle);
    if (err != ESP_OK) {
        LOG_E("OTA", "esp_https_ota_finish failed: %d (%s)", err, esp_err_to_name(err));
        return -4;
    }

    LOG_I("OTA", "esp_https_ota: download + verify complete");
    return 0;
}


// ── otaCheckNow ───────────────────────────────────────────────────────────────
// The main OTA entry point. Fetches the JSON filter file, compares the version,
// and flashes the new firmware if a newer version is available.
// Called periodically from otaLoop() and on demand from the MQTT handler.
//
// `isSiblingRetry` is set to true for the single self-recursive call made after
// a GitHub fetch failure. It prevents infinite recursion if the sibling-
// provided URL also fails — we give up rather than asking the same siblings
// again. Default false keeps the public API unchanged for existing callers.
void otaCheckNow(bool isSiblingRetry) {
    // ── OTA URL validation ────────────────────────────────────────────────────
    // Reject obviously broken URLs before handing them to ESP32-OTA-Pull.
    // A blank URL or one that doesn't start with http(s):// will produce a
    // cryptic HTTP error code with no indication of root cause.
    const char* otaUrl = gAppConfig.ota_json_url;
    bool validScheme = (strncmp(otaUrl, "https://", 8) == 0 ||
                        strncmp(otaUrl, "http://",  7) == 0);
    if (!validScheme || strlen(otaUrl) < 10) {
        LOG_E("OTA", "Skipping check - invalid OTA JSON URL: '%s'", otaUrl);
        mqttPublishStatus(FwEvent::OTA_FAILED,
            "\"stage\":\"preflight\","
            "\"error\":\"invalid ota_json_url (missing scheme or empty)\","
            "\"current_version\":\"" FIRMWARE_VERSION "\"");
        return;
    }

    LOG_I("OTA", "Checking for new firmware... (running: " FIRMWARE_VERSION ")");
    mqttPublishStatus(FwEvent::OTA_CHECKING,
                      "\"current_version\":\"" FIRMWARE_VERSION "\"");

    ESP32OTAPull ota;

    // Progress callback — logs each 10% increment and resets the task watchdog
    // on every invocation so the loopTask's TWDT token stays alive throughout
    // the blocking download.  Without this, loop() is blocked for the full
    // download duration and the TWDT fires (~3 s on this SDK config).
    ota.SetCallback([](int offset, int total) {
        esp_task_wdt_reset();   // Keep loopTask WDT token alive every chunk
        if (_otaProgressWatchdog) xTimerReset(_otaProgressWatchdog, 0);
        static int lastPct = -1;
        int pct = (total > 0) ? (offset * 100 / total) : 0;
        if (pct / 10 != lastPct / 10) {
            LOG_I("OTA", "Progress: %d%%", pct);
            lastPct = pct;
        }
    });

    // ── Pass 1: check only — do not flash yet ────────────────────────────────
    // We pass "0.0.0" as the installed version so the library always fetches
    // the JSON and returns UPDATE_AVAILABLE (its lexicographic comparator breaks
    // on double-digit patch numbers, e.g. "0.2.7" > "0.2.15"). We then apply
    // our own numeric semver comparison via semverIsNewer().
    //
    // URL fallback chain (v0.3.33): primary (NVS-stored gAppConfig.ota_json_url)
    // is tried first; on any HTTP/library failure we walk OTA_FALLBACK_URLS in
    // config.h. If the entire chain returns network-level errors we then ask
    // siblings (sibling-URL fallback unchanged from v0.3.32). This means a dead
    // CDN / Pages outage / bad portal entry no longer strands the device on
    // the first failure.
    int ret = -1;
    const char* successfulUrl = nullptr;
    {
        // Build the candidate list: primary URL first, then any fallbacks
        // that don't equal the primary (de-dup so a portal that points at
        // the GitHub Pages URL doesn't try the same URL twice in a row).
        const char* candidates[1 + OTA_FALLBACK_URL_COUNT];
        uint8_t candCount = 0;
        candidates[candCount++] = gAppConfig.ota_json_url;
        for (uint8_t i = 0; i < OTA_FALLBACK_URL_COUNT; i++) {
            if (strcmp(OTA_FALLBACK_URLS[i], gAppConfig.ota_json_url) != 0) {
                candidates[candCount++] = OTA_FALLBACK_URLS[i];
            }
        }

        for (uint8_t i = 0; i < candCount; i++) {
            esp_task_wdt_reset();   // JSON fetch blocks loop() for ~0.8 s — pre-reset the loopTask WDT
            LOG_I("OTA", "Manifest fetch %u/%u: %s", i + 1, candCount, candidates[i]);
            ret = ota.CheckForOTAUpdate(candidates[i], "0.0.0", ESP32OTAPull::DONT_DO_UPDATE);
            if (ret == ESP32OTAPull::UPDATE_AVAILABLE ||
                ret == ESP32OTAPull::NO_UPDATE_AVAILABLE ||
                ret == ESP32OTAPull::NO_UPDATE_PROFILE_FOUND) {
                successfulUrl = candidates[i];
                if (i > 0) {
                    LOG_I("OTA", "Manifest fetched from fallback URL #%u", i);
                }
                break;
            }
            LOG_W("OTA", "Manifest fetch %u/%u failed (code %d)", i + 1, candCount, ret);
        }
    }

    if (ret == ESP32OTAPull::UPDATE_AVAILABLE) {
        // JSON fetched — now apply our own semver check
        String candidateVer = ota.GetVersion();
        if (!semverIsNewer(FIRMWARE_VERSION, candidateVer.c_str())) {
            responderSetHealthFlag(2, true);
            LOG_I("OTA", "Firmware up to date (running: " FIRMWARE_VERSION ", fetched: %s)",
                  candidateVer.c_str());
            return;
        }
        // Fall through — update is genuinely available
    }

