dj803/esp32_node_firmware/esp32_node_firmware/include/ota.h
    if (ret == ESP32OTAPull::NO_UPDATE_AVAILABLE) {
        // JSON fetched successfully — GitHub is reachable (no profile matched)
        responderSetHealthFlag(2, true);
        LOG_I("OTA", "Firmware up to date (running: " FIRMWARE_VERSION ", fetched: %s)",
              ota.GetVersion().c_str());
        return;
    }

    if (ret == ESP32OTAPull::NO_UPDATE_PROFILE_FOUND) {
        // JSON fetched successfully — GitHub is reachable (no matching profile is not a network error)
        responderSetHealthFlag(2, true);
        LOG_I("OTA", "No matching profile in OTA JSON");
        return;
    }

    if (ret != ESP32OTAPull::UPDATE_AVAILABLE) {
        // Positive ret values are raw HTTP error codes; negative are library codes.
        // JSON fetch failed on EVERY URL in the candidate chain — GitHub /
        // configured CDN are not reachable from this node right now.
        responderSetHealthFlag(2, false);
        LOG_W("OTA", "All %d manifest URLs unreachable (last code %d)",
              1 + OTA_FALLBACK_URL_COUNT, ret);
        char extra[160];
        snprintf(extra, sizeof(extra),
            "\"stage\":\"manifest\","
            "\"error\":\"all manifest URLs unreachable\","
            "\"last_code\":%d,"
            "\"current_version\":\"" FIRMWARE_VERSION "\"",
            ret);
        mqttPublishStatus(FwEvent::OTA_FAILED, extra);

        // Ask siblings for a working OTA URL and retry once with it.
        // espnowRequestOtaUrl() is defined in espnow_responder.h (included before
        // this file). `isSiblingRetry` prevents infinite recursion — the retry
        // call passes true so we won't attempt another round of sibling queries
        // if the sibling-provided URL also fails.
        if (!isSiblingRetry) {
            LOG_I("OTA", "Asking siblings for a working OTA URL...");
            if (espnowRequestOtaUrl()) {
                LOG_I("OTA", "Retrying with sibling-provided URL");
                otaCheckNow(/*isSiblingRetry=*/true);
            }
        }
        return;
    }

    // UPDATE_AVAILABLE — JSON was fetched successfully
    responderSetHealthFlag(2, true);

    // ── Update available ─────────────────────────────────────────────────────
    String targetVersion = ota.GetVersion();
    LOG_I("OTA", "Update available: %s -> %s", FIRMWARE_VERSION, targetVersion.c_str());

    // Snapshot heap state at trigger time (before any teardown). If a future
    // OTA freezes mid-download, correlating this with serial logs lets us
    // distinguish heap-fragmentation stalls from network stalls.
    LOG_I("OTA", "Heap at trigger: free=%u largest=%u",
          heap_caps_get_free_size(MALLOC_CAP_8BIT),
          heap_caps_get_largest_free_block(MALLOC_CAP_8BIT));

    String extra = "\"target_version\":\"" + targetVersion + "\"";
    mqttPublishStatus(FwEvent::OTA_DOWNLOADING, extra.c_str());
    delay(200);   // Give the MQTT publish time to be sent before the download blocks

    // Shut down MQTT and suppress the task watchdog on async_tcp before the
    // blocking download. Three things must happen in order:
    //
    //   1. disconnect(true) — fires onMqttDisconnect asynchronously, which
    //      re-arms the reconnect timer because it sees no active timer.
    //   2. delay(200) — gives the callback time to run and re-arm the timer.
    //   3. xTimerStop — kills the re-armed timer so no reconnect fires during
    //      the download (a mid-download connect attempt blocks async_tcp and
    //      triggers the task watchdog).
    //   4. esp_task_wdt_delete(async_tcp) — even with no reconnect attempt,
    //      async_tcp holds a watchdog subscription and cannot reset its token
    //      while the TCP stack is saturated by the download. Unsubscribing it
    //      prevents the watchdog from firing at ~40-50% progress.
    //      Safe because the device reboots immediately on success.
    // Block reconnect timer from racing with OTA teardown.  The TCP connection
    // may already have dropped (broker-initiated disconnect during the JSON
    // fetch), which means onMqttDisconnect already started the 1000 ms
    // reconnect timer.  Without this guard that timer fires from the timer
    // task and calls _mqttClient.connect() simultaneously with our disconnect,
    // corrupting AsyncMqttClient state and crashing _xt_context_restore.
    _mqttOtaActive = true;
    if (_mqttReconnectTimer) xTimerStop(_mqttReconnectTimer, 0);  // kill pre-existing timer

    _mqttClient.disconnect(true);
    delay(200);   // Let onMqttDisconnect fire (it will NOT re-arm the timer)
    if (_mqttReconnectTimer) xTimerStop(_mqttReconnectTimer, 0);  // defensive: kill if re-armed anyway
    TaskHandle_t asyncTcpTask = xTaskGetHandle("async_tcp");
    if (asyncTcpTask) esp_task_wdt_delete(asyncTcpTask);

    // Free NimBLE heap before the blocking download so Update.begin() can
    // allocate its 4 KB write buffer. mbed TLS keeps two 16 KB SSL record
    // buffers live during HTTPS; NimBLE's host allocations (~20-40 KB) are the
    // only large pool we can safely release without touching the active WiFi/TLS
    // stack. The device reboots on success (BLE inits fresh at next boot). On
    // failure we also restart (see below), so the deinit is always safe.
#ifdef BLE_ENABLED
    LOG_I("OTA", "Heap before BLE deinit: free=%u largest=%u",
          heap_caps_get_free_size(MALLOC_CAP_8BIT),
          heap_caps_get_largest_free_block(MALLOC_CAP_8BIT));
    NimBLEDevice::deinit(true);
    LOG_I("OTA", "Heap after BLE deinit:  free=%u largest=%u",
          heap_caps_get_free_size(MALLOC_CAP_8BIT),
          heap_caps_get_largest_free_block(MALLOC_CAP_8BIT));
#endif

    // ── Pre-flight heap gate (v0.3.33) ───────────────────────────────────────
    // After all teardown / deinit has completed but BEFORE we kick off the
    // blocking download, verify we have enough headroom for mbedTLS record
    // buffers (~16 KB IN + 16 KB OUT) PLUS Update.begin's 4 KB write buffer.
    // If we don't, abort cleanly. The next OTA_CHECK_INTERVAL_MS retry will
    // try again from a freshly-rebooted heap state.
    {
        size_t freeNow    = heap_caps_get_free_size(MALLOC_CAP_8BIT);
        size_t largestNow = heap_caps_get_largest_free_block(MALLOC_CAP_8BIT);
        if (freeNow < OTA_PREFLIGHT_HEAP_FREE_MIN ||
            largestNow < OTA_PREFLIGHT_HEAP_BLOCK_MIN) {
            LOG_E("OTA", "Pre-flight heap gate FAILED: free=%u (min %u) largest=%u (min %u)",
                  (unsigned)freeNow, (unsigned)OTA_PREFLIGHT_HEAP_FREE_MIN,
                  (unsigned)largestNow, (unsigned)OTA_PREFLIGHT_HEAP_BLOCK_MIN);
            // Re-init what we tore down so the device stays useful until next retry.
            // BLE will re-init on next boot anyway when ESP.restart() runs;
            // we restart here too to guarantee a known-good state.
            char extra[192];
            snprintf(extra, sizeof(extra),
                "\"stage\":\"preflight\","
                "\"error\":\"heap_low\","
                "\"free\":%u,\"largest\":%u,"
                "\"free_min\":%u,\"largest_min\":%u,"
                "\"current_version\":\"" FIRMWARE_VERSION "\"",
                (unsigned)freeNow, (unsigned)largestNow,
                (unsigned)OTA_PREFLIGHT_HEAP_FREE_MIN,
                (unsigned)OTA_PREFLIGHT_HEAP_BLOCK_MIN);
            mqttPublishStatus(FwEvent::OTA_PREFLIGHT, extra);
            delay(200);     // let the publish drain
            ESP.restart();  // fresh heap on next boot — natural retry
        }
    }

    // In arduino-esp32 3.x, loopTask is not subscribed to the TWDT by default.
    // If we call esp_task_wdt_reset() in the progress callback without first
    // subscribing, ESP-IDF logs an E-level "task not found" message every chunk
    // (~hundreds of formatted prints deep inside the HTTPS call stack).  That
    // accumulated stack pressure causes an IllegalInstruction crash at ~60%.
    // Subscribe loopTask now; ESP_ERR_INVALID_ARG = already subscribed (benign).
    {
        esp_err_t wdtE = esp_task_wdt_add(NULL);
        if (wdtE != ESP_OK && wdtE != ESP_ERR_INVALID_ARG) {
            LOG_W("OTA", "esp_task_wdt_add(loopTask) failed: %d", wdtE);
        }
    }

    // ── Pass 2: download and flash, but do not reboot yet ────────────────────
    // UPDATE_BUT_NO_BOOT lets us publish ota_success before the connection drops.
    ledSetPattern(LedPattern::OTA_UPDATE);   // solid ON — flash write in progress
    { LedEvent e{}; e.type = LedEventType::OTA_START; ws2812PostEvent(e); }

    // Arm the per-chunk progress watchdog: created lazily so multiple OTA
    // attempts in one boot reuse a single timer object. Each progress callback
    // resets it; if no callback fires for OTA_PROGRESS_TIMEOUT_MS, the timer
    // task calls ESP.restart() to break the stall.
    if (!_otaProgressWatchdog) {
        _otaProgressWatchdog = xTimerCreate("ota_wd",
                                            pdMS_TO_TICKS(OTA_PROGRESS_TIMEOUT_MS),
                                            pdFALSE,   // one-shot
                                            NULL,
                                            _otaProgressTimeout);
    }
    if (_otaProgressWatchdog) xTimerStart(_otaProgressWatchdog, 0);

