dj803/esp32_node_firmware/esp32_node_firmware/include/ota.h
    // (v0.3.35 / Phase 3) Pass 2 now uses esp_https_ota with HTTP resume
    // support, replacing ESP32-OTA-Pull's blocking writer. Steps:
    //   1. Re-fetch the manifest to extract the .bin URL (ESP32-OTA-Pull
    //      does not expose this after Pass 1).
    //   2. Hand the .bin URL to esp_https_ota with partial_http_download=true.
    //   3. esp_https_ota_perform() loop with progress + watchdog hooks.
    const char* manifestUrlForBinary = (successfulUrl != nullptr)
                                       ? successfulUrl : gAppConfig.ota_json_url;
    String binaryUrl = otaExtractBinaryUrl(manifestUrlForBinary);
    if (binaryUrl.length() == 0) {
        LOG_E("OTA", "Could not extract binary URL from manifest %s", manifestUrlForBinary);
        if (_otaProgressWatchdog) xTimerStop(_otaProgressWatchdog, 0);
        char extra[192];
        snprintf(extra, sizeof(extra),
            "\"stage\":\"manifest_url\","
            "\"error\":\"binary URL extraction failed\","
            "\"current_version\":\"" FIRMWARE_VERSION "\"");
        mqttPublishStatus(FwEvent::OTA_FAILED, extra);
        delay(200);
        ESP.restart();
    }

    int otaResult = otaPerformWithEspIdf(binaryUrl.c_str());

    // Download returned (success or failure) — disarm the stall watchdog.
    if (_otaProgressWatchdog) xTimerStop(_otaProgressWatchdog, 0);

    if (otaResult == 0) {
        LOG_I("OTA", "Flash succeeded - restarting");
        mqttPublishStatus(FwEvent::OTA_SUCCESS,
            ("\"new_version\":\"" + targetVersion + "\"").c_str());
        // (v0.3.34) Arm the post-OTA validation gate. The NEW firmware reads
        // this NVS flag in otaValidationCheckBoot() — if it sees its own
        // FIRMWARE_VERSION as the pending version, it sets the validation
        // deadline and rolls back if MQTT doesn't come back up in time.
        otaValidationArmRollback(targetVersion.c_str());
        delay(500);     // Give the MQTT publish time to be sent before disconnect
        ESP.restart();  // Boot into the new firmware — watchdog state doesn't matter
    } else {
        LOG_E("OTA", "Flash failed (esp_https_ota result %d) — restarting to recover", otaResult);
        { LedEvent e{}; e.type = LedEventType::OTA_DONE; ws2812PostEvent(e); }
        char extra[160];
        snprintf(extra, sizeof(extra),
            "\"stage\":\"flash\","
            "\"error\":\"esp_https_ota failed\","
            "\"code\":%d,"
            "\"current_version\":\"" FIRMWARE_VERSION "\"",
            otaResult);
        // MQTT was deliberately disconnected before the download — publish
        // is best-effort (will be retained on the device-level LWT path).
        // BLE was also deinited. The device is in a degraded state —
        // restart cleanly rather than re-adding async_tcp to the WDT, which
        // would resume processing buffered data through a torn-down
        // AsyncMqttClient and crash with an InstrFetchProhibited null-vtable panic.
        mqttPublishStatus(FwEvent::OTA_FAILED, extra);
        delay(200);   // Let the LED OTA_DONE event post to the WS2812 task
        ESP.restart();
    }
}


// ── otaLoop ───────────────────────────────────────────────────────────────────
// Periodic OTA check driver — must be called from loop().
// Fires otaCheckNow() when either:
//   a) OTA_CHECK_INTERVAL_MS has elapsed since the last check, OR
//   b) otaTrigger() was called (e.g. from the MQTT handler)
void otaLoop() {
    if (_otaForced || (millis() - _lastOtaCheck >= OTA_CHECK_INTERVAL_MS)) {
        _lastOtaCheck = millis();   // Reset the interval timer
        _otaForced    = false;      // Clear the force flag
        otaCheckNow();
    }
}


// ── otaTrigger ────────────────────────────────────────────────────────────────
// Schedules an immediate OTA check on the next loop() iteration.
// Called by the MQTT message handler when a message arrives on .../cmd/ota_check.
// Setting a flag (rather than calling otaCheckNow() directly) keeps the MQTT
// callback short and avoids blocking the AsyncMqttClient's internal task.
void otaTrigger() {
    _otaForced = true;   // otaLoop() will call otaCheckNow() on the next loop tick
}
